{"cursor":"5963","size":15,"audio":[],"currentlang":"en","article":"\nIn linguistics, 'productivity' is the degree to which native speakers use a\nparticular grammatical process, especially in word formation. Since use to\nproduce novel (new, non-established) structures is the clearest proof of usage\nof a grammatical process, the evidence most often appealed to as establishing\nproductivity is the appearance of novel forms of the type the process leads one\nto expect, and many people would limit the definition offered above to exclude\nuse of a grammatical process that does not result in a novel structure. Thus in\npractice, and, for many, in theory, productivity is the degree to which native\nspeakers use a particular grammatical process for the formation of novel\nstructures. A productive grammatical process defines an 'open class', one which\nadmits new words or forms. Non-productive grammatical processes may be seen as\noperative within 'closed classes', but only previously formed and learned\nstructures show the results of those processes.\n\nIn standard English, the formation of preterite and past participle forms of\nverbs by means of ablaut (for example, sing–sang–sung) is no longer\nconsidered productive. Newly coined verbs in English overwhelmingly use the\nending -ed for the past tense and past participle (for example, [[spam\n(electronic)|spammed]], [[electronic mail|e-mailed]]). There are more recent\nablaut forms, howeverâe.g. snuck as the preterite and participial form of sneak,\nor dove as the preterite of dive. Such cases are standardly said to have been\ncreated by analogy instead of by productive application of ablaut rules, though\nthis may to some extent be begging the question. Similarly, the only clearly\nproductive plural ending is -(e)s; it is found on the vast majority of English\ncount nouns and is the almost exclusive means used to form the plurals of\nneologisms, such as [[FAQ]]s and [[Muggle]]s. The ending -en, on the other hand,\nis (at least relatively speaking) no longer productive, being found only in\noxen, children, and the now-rare brethren. In the hacker sociolect, however, the\nplural -en became at least ephemerally productive for words ending with (on the\nanalogy of ox:oxen), as illustrated by the plurals [[boxen\n(disambiguation)|boxen]], [[VAX]]en, [[unix]]en, [[emacs]]en, and Searching\nWikipedia user space for \"userboxen\" returns numerous hits of the form\nUser:*/Userboxen for example.\n\nProductivity is, as stated above and implied in the examples already discussed,\na matter of degree, and there are a number of areas in which that may be shown\nto be true. As the example of -en becoming productive shows, what has apparently\nbeen non-productive for many decades or even centuries may suddenly come to some\ndegree of productive life, and it may do so in certain dialects or sociolects\nwhile not in others, or in certain parts of the vocabulary but not others. Some\npatterns are only very rarely productive, others may be used by a typical native\nspeaker several times a year or month, whereas others (especially syntactic\nprocesses) may be used productively dozens or hundreds of times in a typical\nday. It is not atypical for more than one pattern with similar functions to be\ncomparably productive, to the point that a speaker can be in a quandary as to\nwhich form to use âe.g., would it be better to say that a taste or color like\nthat of raisins is raisinish, raisiny, raisinlike, or even raisinly? (All four\ncan be found on the Internet.)\n\nIt can also be very difficult to assess when a given usage is productive or when\na person is using a form that has already been learned as a whole. Suppose a\nreader comes across an unknown word such as despisement meaning \"an attitude of\ndespising\". The reader may apply the verb+ment noun-formational process to\nunderstand the word perfectly well, and this would be a kind of productive use.\nThis would be essentially independent of whether or not the writer had also used\nthe same process productively in coining the term, or whether he or she had\nlearned the form from previous usage (as most English speakers have learned\ngovernment, for instance), and no longer needed to apply the process\nproductively in order to use the word. Similarly a speaker or writer's use of\nwords like raisinish or raisiny may or may not involve productive application of\nthe noun+ish and noun+y rules, and the same is true of a hearer or reader's\nunderstanding of them. But it will not necessarily be at all clear to an outside\nobserver, or even to the speaker and hearer themselves, whether the form was\nalready learnt and whether the rules were applied or not.\n","linknr":117,"url":"Productivity_(linguistics)","recorded":1362684695,"links":17,"instances":["programmer_subculture"],"pdf":[],"categories":["Linguistic morphology","Grammar"],"headings":["See also","References","Notes"],"image":["//upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png","//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[["hacker","programmer_subculture"]],"members":["hacker"],"related":["Linguistics","Native_speaker","Word_formation","English_language","Preterite","Participle","Verb","Indo-European_ablaut","Analogy","Begging_the_question","English_plural","Count_noun","Hacker_(programmer_subculture)","Sociolect","Analogy","Syntax","Word_formation","Inflection"]}